{
    "showID": 101,
    "showName": "Miracle That We Met",
    "otherNames": [
        "178 users ) Ranked: #2558 Popularity: #2704 Content Rating: 15+ - Teens 15 or older Watchers: 7",
        "178 users) Ranked: #2558 Popularity: #2704 Watchers: 7",
        "2018 - May 29",
        "2018 - May 29",
        "2018 18 of 18 episodes seen Completed 0 Overall 9.0 Story 9.5 Acting/Cast 10 Music 9.0 Rewatch Value 8.0 What a fantastic drama! It was definitely of of the best I've watched",
        "2018 18 of 18 episodes seen Completed 2 Overall 8.0 Story 8.5 Acting/Cast 9.0 Music 8.5 Rewatch Value 7.0 I'll go with a short review. The reason I started this drama was because it was getting quite high ratings in SK",
        "2018 Aired On: Monday",
        "2018 Aired On: Monday",
        "599 Favorites: 0 Remove ads Where to Watch Miracle That We Met Viki Free (sub) Kocowa Subscription Cast & Credits Add Cast Kim Myung Min Song Hyun Cheol (A) Main Role Kim Hyun Joo Sun Hye Jin Main Role Ra Mi Ran Jo Yeon Hwa Main Role Ko Chang Seok Song Hyun Cheol [#B] Main Role Joseph Lee Geum Sung Moo Main Role Park Sung Geun Oh Jang Choon Support Role View all (66) Photos View all (5) Reviews Write Review Completed AnanyaS 23 people found this review helpful Other reviews by this user 2 May 30",
        "599 Favorites: 0 Top Contributors NightTraveller 54 edits Squirl 38 edits AnastasiaWun 37 edits Hide Your Heart 21 edits News & Articles Kim Hyun Joo will reportedly star alongside Kim You Jung in Extraordinary Attorney Woo director's ne \"Reply 1988\" actor Choi Sung Won joins TVING K-drama \"Pyramid Game\" Popular Lists Related lists from users Create a list List for EXO-Ls ~ 74 titles 215 loves 4 Best Time Travel Dramas 158 titles 1174 voters 154 loves 34 Onde assistir? 6453 titles 104 loves 2 Recently Watched By Remove ads © Copyright 2025. All rights reserved. Download on the App Store Download on the Google Play About FAQ About Us Contact Terms Privacy Support Us Dark Mode Work With Us Advertise API Recommended K-Dramas Calendar Top 100 K-Dramas Top 100 Japanese Dramas Top 100 Chinese Dramas Top Anime",
        "Character Development",
        "Detective Supporting Character",
        "Fantasy",
        "Hye Jin and Yun Hwa. Their struggle with this new reality that they face",
        "I can see the reason(s). Well",
        "Jo Woong Genres: Comedy",
        "Melodrama Tags: Rags To Riches",
        "Romance",
        "Spirit",
        "Supernatural (Vote tags) Country: South Korea Type: Drama Episodes: 18 Aired: Apr  2",
        "The Miracle We Met",
        "Transmigration",
        "Tuesday Original Network: KBS2 Duration: 60 min. Content Rating: 15+ - Teens 15 or older Statistics Score: 8.0 (scored by 2",
        "Tuesday Original Network: KBS2 Duration: 60 min. Score: 8.0 (scored by 2",
        "Uriga Mannan Gijeok",
        "Wooriga Mannan Kijeok Screenwriter: Baek Mi Kyung Director: Lee Hyung Min",
        "and I was curious as to why. And after watching it",
        "as a viewer",
        "but I wish people would watch it",
        "but Kai is wonderfully and deliciously beautiful. - The drama focused on human behavior. And the mesaage it send is a good one. The things that I wasn't sure about: - This was more of a slow paced drama. Which isn't necessarily a bad thing. But around the middle part",
        "complicated. I",
        "especially Kim Myung Min (he will for me be one of the best male performance in drama this year with Lee Sun Kyun and Ji Jin Hee). Not to forget the OST  that mixed really well with all the scenes! I don't give it a 10 because this drama had a little problem",
        "fantasy and funny-tragedy (I don't know if this exist) you will really like it. Read More Was this review helpful to you? Yes No Cancel View all Recommendations Add Recommendations Recent Discussions New Topic Be the first to create a discussion for Miracle That We Met Remove ads Remove ads Details Title: Miracle That We Met Type: Drama Format: Standard Series Country: South Korea Episodes: 18 Aired: Apr  2",
        "go ahead and give it a try. Happy Watching!! Read More Was this review helpful to you? Yes No Cancel Completed Romane 14 people found this review helpful Other reviews by this user 0 May 30",
        "he was quite important in the beginning because we saw him quite often but after we didn't saw him at all",
        "it did seem a bit draggy. - A lot of moral dilemmas involved in the drama which I wasn't sure how to feel about. While the drama wasn't solely focused on romantic relationships",
        "it's a drama that deserves a chance. And it's quite enjoyable. So",
        "like some people said in the comments",
        "not many did thought it was really really good! If you like family",
        "not one of my ultimate favorite but still it was really well done. From the not predictable story which is really rare to do with k-dramas because you generally always know how it's going to end; to the superb acting done by everyone",
        "romance",
        "so I was like why did they introduce this guy to us if at the end they don't even matter?? (people who watched it will know about who I'm talking). I don't think everyone can like that kind of drama because a lot of people prefer to watch basic rom-com with young actors most of the time (and ofc I like it too)",
        "that they never expected is portrayed wonderfully. - The music is good. Specially the song 'Monochrome'. It fit the settings perfectly. - The kid actors did a good job too. - Not to sound like a fangirl or anything",
        "there could be a right and wrong in such exaggerated fantasical situation. Overall",
        "there was a little disappointment with one of the character story turn",
        "they were quite...well",
        "to an extent anyway. The things that I liked about the drama: -The storyline is unique. Not the one-person's-soul-entering-another-body thing. But the part that came after that. - The acting is top notch. You can feel every emotion of Song Huun Chul",
        "to the extent that they were present",
        "wasn't sure if what the male lead was doing could be considered \"right\". If"
    ],
    "showImage": null,
    "watchStartedOn": "03-03-2023",
    "watchEndedOn": "04-03-2023",
    "releasedYear": 2018,
    "releaseDate": "Apr  2, 2018",
    "totalEpisodes": 18,
    "showType": "Drama",
    "nativeLanguage": "Korean",
    "watchedLanguage": "Korean",
    "country": "South Korea",
    "comments": "Excellent. No Words To Explain. Though Out The Series, I Never Felt Anything Boring. However The Final Part Is Unexpected, If They Didn't Reverse The Time , It Would Be Much Better.",
    "ratings": 10,
    "genres": [
        "Family",
        "Fantasy",
        "Melodrama"
    ],
    "network": [
        "KBS2"
    ],
    "againWatchedDates": [
        "14-03-2023",
        "07-06-2023",
        "09-11-2023",
        "12-09-2023",
        "02-08-2025",
        "21-08-2025"
    ],
    "updatedOn": "01 November 2025",
    "updatedDetails": "Again Watched Dates Updated",
    "synopsis": "Miracle That We Met (Korean Drama); 우리가 만난 기적; The Miracle We Met;Uriga Mannan Gijeok;Wooriga Mannan Kijeok; An ordinary man dies in a car crash, (Source: MyDramaList)",
    "topRatings": 7000,
    "Duration": 60,
    "sitePriorityUsed": {
        "showImage": null,
        "releaseDate": "mydramalist",
        "otherNames": "mydramalist",
        "duration": null,
        "synopsis": "mydramalist",
        "Duration": "mydramalist"
    }
}