{
    "showID": 105,
    "showName": "It's Okay to Not be Okay",
    "otherNames": [
        "2020 - Aug  9",
        "2020 - Aug  9",
        "2020 16 of 16 episodes seen Completed 19 Overall 10 Story 10 Acting/Cast 10 Music 10 Rewatch Value 10 This review may contain spoilers WHAT A JOURNEY IT HAS BEEN First of all",
        "2020 16 of 16 episodes seen Completed 6 Overall 10 Story 10 Acting/Cast 10 Music 10 Rewatch Value 10 The drama closest to my heart. There are dramas that you either enjoy watching or you don’t. And then there are dramas like this that manage to reach the deepest parts of your heart. I believe It’s Okay to Not be Okay is a drama that you’ll fall in love with when the story hits close to home. There are many scenes throughout this drama that really made me cry and touched me in so many ways. And no",
        "2020 Aired On: Saturday",
        "2020 Aired On: Saturday",
        "2020 View all Remove ads Remove ads Details Title: It's Okay to Not Be Okay Type: Drama Format: Standard Series Country: South Korea Episodes: 16 Aired: Jun 20",
        "2020 post finale by lololol 1 0 girl Aug 10",
        "2021 I composed a piano song based on the characters and inspired by the OST of It's Okay to not be okay. by Matthew Olls 2 0 Matthew Olls Aug 14",
        "2023 Theories on MY's mother..... by MistyMaid 4 0 Kelekat Mar 24",
        "2023 her outfits by Sashadrama 5 0 Ruth Sep 23",
        "687 users ) Ranked: #126 Popularity: #3 Content Rating: 15+ - Teens 15 or older Watchers: 256",
        "687 users) Ranked: #126 Popularity: #3 Watchers: 256",
        "730 Favorites: 0 Remove ads Where to Watch It's Okay to Not Be Okay Netflix Subscription (sub) Cast & Credits Add Cast Kim Soo Hyun Moon Gang Tae Main Role Seo Yea Ji Ko Mun Young Main Role Oh Jung Se Moon Sang Tae Main Role Park Gyu Young Nam Ju Ri [Gang Tae's co-worker] Support Role Jang Young Nam Park Haeng Ja [OK Psychiatric Hospital's head nurse] Support Role Kim Chang Wan Oh Ji Wang [OK Psychiatric Hospital's director] Support Role View all (74) Photos View all (612) Reviews Write Review Completed Hoshi Lover 184 people found this review helpful Other reviews by this user 6 Aug  9",
        "730 Favorites: 0 Top Contributors Tarnished 614 edits hoshiakari 257 edits Beatrix 87 edits Cryssy Anne 54 edits News & Articles Seo Yea Ji's possible comeback K-drama said to be based on horror webtoon Kim Sun Young confirmed to star alongside Park Bo Young and GOT7's Park Jin Young in 'Our Unwritten Popular Lists Related lists from users Create a list All Time Favorite Dramas 807 titles 2010 loves 38 tvN Dramas 353 titles 234 loves Favorite Dramas - Happy End 278 titles 185 loves 13 Recently Watched By Remove ads © Copyright 2025. All rights reserved. Download on the App Store Download on the Google Play About FAQ About Us Contact Terms Privacy Support Us Dark Mode Work With Us Advertise API Recommended K-Dramas Calendar Top 100 K-Dramas Top 100 Japanese Dramas Top 100 Chinese Dramas Top Anime",
        "Badass Female Lead",
        "CEO",
        "Childhood Connection",
        "Comedy",
        "Dar E-a Mea",
        "Director",
        "Dotkni se mých ran",
        "Drama Tags: Independent Female Lead",
        "E Nebună",
        "Está bien no estar bien",
        "Healing",
        "I am here for the relationships and development of the characters. It’s a small part of what is overall a satisfying journey. I finally agree with Kim Soo Hyun when he said that this is a healing drama. After all the sadness and pain",
        "I don’t see Kim Soo Hyun",
        "I finally felt the happiness and healing. This drama might be either something you love or you don’t. We all have different stories. But what I’m really sure of is that this drama will always have a special place in my heart. :’) Read More Was this review helpful to you? Yes No Cancel Completed Rjei27 1 2 305 people found this review helpful Other reviews by this user 19 Aug  9",
        "I found really awesome people because of our shared suffering while waiting every week (you know who you guys are! <3). IOTNBO has made these past two months better and I can’t believe how time passed by so quickly. I just loved everything about this drama: the cinematography",
        "I'm a Psycho but It's Okay",
        "It’s Okay to Not Be Okay",
        "Jaesu",
        "Jung Dong Yoon Screenwriter: Jo Yong Genres: Psychological",
        "Juri",
        "Kim Soo Hyun.... I have to be honest",
        "Ko Moon Young",
        "Melodrama",
        "Mental Illness (Vote tags) Country: South Korea Type: Drama Episodes: 16 Aired: Jun 20",
        "Possessive Female Lead",
        "Psycho But It's All Right",
        "Psycho But It's Fine",
        "Psycho But It's Okay",
        "Psycho But It’s Okay",
        "Romance",
        "SEung Jae",
        "Saikojiman Gwaenchanha",
        "Saikojiman gwaenchana",
        "Sang Tae and Gang Tae. From episode 1 to 16 we saw their character developments and how they were healed in the process of knowing each other. There might be an evil witch who took their real faces",
        "Selfless Male Lead",
        "Seo Ye Ji",
        "Seo Ye Ji",
        "Successful Female Lead",
        "Sunday Original Network: tvN Duration: 1 hr. 15 min. Content Rating: 15+ - Teens 15 or older Statistics Score: 8.9 (scored by 148",
        "Sunday Original Network: tvN Duration: 1 hr. 15 min. Score: 8.9 (scored by 148",
        "Trauma",
        "Tudo Bem Não Ser Normal",
        "acting",
        "and MY was too young and grew with too much trauma to remember everything and just remembered the trauma she experienced during her childhood. Once the \"Finding the Real Face\" story was told",
        "and Moon Sang Tae",
        "and Oh Jung Se anymore. It is Moon Kang Tae",
        "and Oh Jung Se showed us stellar acting performances and broke my heart so many times. Even the supporting characters were really good at their roles. The OST was something that kept me going while waiting each week and I really appreciate how they had English songs. I also loved how the story had a balance between sad and happy moments. I usually get bored by a drama that’s too sad so I like how they insert comedic scenes in between. There are also so many relatable quotes and one of my favorites is a piece of advice from Doctor Oh. “When you’re tired",
        "and creative transitions. Kim Soo Hyun",
        "and many people became a huge fan of Moon Gang Tae's character.... and lastly",
        "and scriptwriting. This drama always gave us beautiful shots",
        "as a fan of KSH",
        "awesome animation",
        "being such amazing actors themselves could have easily stole the limelight from KSH. Moon Gang Tae's character was less explosive and more contemplative. His role is very deep and requires consistency. Many of his emotions must be conveyed using his eyes alone. and he did it perfectly. His crying scenes have different emotions and meanings especially his breakdown scene on episode 9. It felt like he poured his heart and soul on that scene and the audience felt it. The fact that KSH was able to get rave reviews for his performance both internationally and locally",
        "but like in any fairy tale",
        "especially the one in the ending. I admire the writer for writing these fairytales on top of writing a drama. I know this drama is by no means perfect. It still left me with a few questions about Moon Young’s mom. But truth be told",
        "everything made sense to me that this drama is not about MY's mother. It's about the journey of Moon Young",
        "get some rest. When you’re sad",
        "go ahead and cry. It's okay to do that.\" Damn",
        "go ahead and cry. It’s okay to take a break. Then one day",
        "he chose It's Okay to Not Be Okay. He really took time in reading  many scripts and he really wants to challenge himself. His role is not as flashy or flamboyant as Moon Young and Sang Tae.... What makes his performance a stand out was the fact that his character wasn't a stand out. SYJ and OJS",
        "i just like to say that this Series is not for everyone. I know everyone has different tastes especially in dramas. Aside from being a HUMAN HEALING DRAMA",
        "i learned so much from this drama. I immersed myself in the show and this show really healed me to overcome some of the trauma and regrets i have in my life. The title itself is such a meaningful and powerful  phrase that \"It's Okay to Not Be Okay\".  Here are some of the lessons i learned from this drama. - Family is Beyond Blood Relations - Fight for your Happiness - Don't Make Rash Decisions - Don't Judge a book by its cover - Confront your Trauma - Remember Good Memories - Speak Up for Yourself - Reach Out for Help - It's Better to Kiss than Fight \"When you're tired get some rest. When your sad",
        "i really did not understand at first why he chose this project. Maybe i was used to A list actors to work with more known and award winning directors and writers. After his last drama The Producers in 2015 and military enlistment in 2017",
        "i was really waiting for his comeback and has high expectations on the first project he'll work on. THANK GOD",
        "i'm very grateful for this show because i met many friends who will be my forever MDL friends! I felt like i was also riding in the camping van when the show ended. It really is  a great and amazing  journey. Thank you OKAY Family! Thank you IT'S OKAY TO NOT BE OKAY. Read More Was this review helpful to you? Yes No Cancel View all Recommendations Add Recommendations Recent Discussions New Topic Title Replies Views Latest Post Kim soo hyun crime receipts by God 0 0 No discussions yet Ko Mun Yeong's Mother death circumstances investigation by HopeGlory 30 0 Kelekat Mar 24",
        "in the end",
        "it wasn’t all the sad moments. The characters in this drama felt so real that I even cried out of happiness for them. Every time I watch this",
        "soundtrack",
        "that KSH was able to showcase such amazing and brilliant acting range for a role that's quite a challenge... that's really IMPRESSIVE and not all actors would be able to accomplish that.. I'm just happy that KSH is a risk taker and took this risk and not doing the usual OPPA dramas. CINEMATOGRAPHY/MUSICAL SCORING/EDITING - We have to commend the cinematographer of this show. WOW. just WOW! the camera shots are so perfect. i love how the cinematographer used different techniques. It was so effective. Same as the editing. I love the transitions from one scene to another. Not just the cool transitions but just the regular transitions where musical scoring is used to properly connect one scene from another. OVERALL - this show will be one of my all time favorites. I have to admit that i expected more from the mother's plot. maybe because i watch too many crime dramas and i wanted more explanation how the mother survived or what really happened. I guess i overthought and had watched too many theory videos that i forgot what the show was all about. Thank you to the Finale episode\"FINDING THE REAL FACE\". My take on the mother's plot is very simple. The mother survived and whatever stories we saw from the father's POV and MY's are not really accurate since  the father had brain injury and even had major surgery for that",
        "the OK staff and patients. Everyone had amazing perfomances. Now for my bias",
        "there so many life learning quotes in this show. Watching this while on air is the best decision i made this year. Usually i will wait for a show to be completed before i binge watch but i made an exception for IOTNBO. I really invested too much in this drama. I'm happy to be one of the active posters in IOTNBO page and one of the users who broke records of having 16k+++ comments on the 16th episode. Most of all",
        "there will always be a happy ending. Reading this definitely gave me some closure on the mother mystery : https://chasehermes.tumblr.com/post/625989613310394368/i-was-thinking-about-why-the-show-did-not-discuss I have to say that this drama has one of the best finales and most satisfying endings I've ever watched. I don't know how many times i cried watching all episodes but one thing is for sure",
        "there will surely come a day when you’ll be able to run again.” Another thing I really loved about this drama is how it was able to incorporate fairytales and stories in every episode. Ko Moon Young’s stories in particular were all really good",
        "this is the first time I ever felt this way about a drama. I’ve watched ongoing dramas but I have never been this excited for every episode. My Saturdays and Sundays were never the same and without meaning to",
        "this show is a character driven kind of drama. You have to immerse yourself in the drama to fully understand and go through the process of healing while watching the show. STORY - I really love the story. It's unique and refreshing how the writer used many fairy tale and folk tales references and combined all those stories into one. It's so brilliant. ACTING - Now let's talk about the performances for the Actors. Immediately after watching episode 1",
        "who I felt closer to than any character I’ve seen before. Honestly",
        "you will be amazed already of Oh Jung Seng's performance. It really is a role of a lifetime. He is so effective as Moon Sang Tae. I cry on most of his scenes with Gang Tae. He exceeded everyone's expectations and he will definitely get many awards from this show. Seo Ye Ji's role is also very challenging. She is phenomenal as Moon Young. I cannot think of anyone who can do this role as perfect as her. Supporting Roles from the younger casts",
        "Зціли мене",
        "Псих",
        "но всё в порядке",
        "لا بأس إن لم تكن بخير",
        "เรื่องหัวใจ ไม่ไหวอย่าฝืน",
        "虽然是精神病但没关系 Director: Park Shin Woo"
    ],
    "showImage": null,
    "watchStartedOn": "07-02-2023",
    "watchEndedOn": "08-02-2023",
    "releasedYear": 2020,
    "releaseDate": "Jun 20, 2020",
    "totalEpisodes": 16,
    "showType": "Drama",
    "nativeLanguage": "Korean",
    "watchedLanguage": "Korean",
    "country": "South Korea",
    "comments": "Very Nice Psychological Series I Ever Watched.And The Ending Is Fabulous. It Touched My Heart",
    "ratings": 10,
    "genres": [
        "Comedy",
        "Psychological",
        "Romance"
    ],
    "network": [
        "tvN"
    ],
    "againWatchedDates": [
        "14-09-2023",
        "05-02-2024",
        "26-08-2024",
        "19-08-2025"
    ],
    "updatedOn": "01 November 2025",
    "updatedDetails": "First Time Uploaded",
    "synopsis": "It's Okay to Not Be Okay (Korean Drama); 사이코지만 괜찮아; Dotkni se mých ran;E Nebună, Dar E-a Mea;Está bien no estar bien;I'm a Psycho but It's Okay;It’s (Source: MyDramaList)",
    "topRatings": 5000,
    "Duration": 15,
    "sitePriorityUsed": {
        "showImage": null,
        "releaseDate": "mydramalist",
        "otherNames": "mydramalist",
        "duration": null,
        "synopsis": "mydramalist",
        "Duration": "mydramalist"
    }
}