[
    {
        "showID": 101,
        "showName": "Miracle That We Met",
        "otherNames": [
            "178 users ) Ranked: #2558 Popularity: #2704 Content Rating: 15+ - Teens 15 or older Watchers: 7",
            "178 users) Ranked: #2558 Popularity: #2704 Watchers: 7",
            "2018 - May 29",
            "2018 - May 29",
            "2018 18 of 18 episodes seen Completed 0 Overall 9.0 Story 9.5 Acting/Cast 10 Music 9.0 Rewatch Value 8.0 What a fantastic drama! It was definitely of of the best I've watched",
            "2018 18 of 18 episodes seen Completed 2 Overall 8.0 Story 8.5 Acting/Cast 9.0 Music 8.5 Rewatch Value 7.0 I'll go with a short review. The reason I started this drama was because it was getting quite high ratings in SK",
            "2018 Aired On: Monday",
            "2018 Aired On: Monday",
            "599 Favorites: 0 Remove ads Where to Watch Miracle That We Met Viki Free (sub) Kocowa Subscription Cast & Credits Add Cast Kim Myung Min Song Hyun Cheol (A) Main Role Kim Hyun Joo Sun Hye Jin Main Role Ra Mi Ran Jo Yeon Hwa Main Role Ko Chang Seok Song Hyun Cheol [#B] Main Role Joseph Lee Geum Sung Moo Main Role Park Sung Geun Oh Jang Choon Support Role View all (66) Photos View all (5) Reviews Write Review Completed AnanyaS 23 people found this review helpful Other reviews by this user 2 May 30",
            "599 Favorites: 0 Top Contributors NightTraveller 54 edits Squirl 38 edits AnastasiaWun 37 edits Hide Your Heart 21 edits News & Articles Kim Hyun Joo will reportedly star alongside Kim You Jung in Extraordinary Attorney Woo director's ne \"Reply 1988\" actor Choi Sung Won joins TVING K-drama \"Pyramid Game\" Popular Lists Related lists from users Create a list List for EXO-Ls ~ 74 titles 215 loves 4 Best Time Travel Dramas 158 titles 1174 voters 154 loves 34 Onde assistir? 6453 titles 104 loves 2 Recently Watched By Remove ads © Copyright 2025. All rights reserved. Download on the App Store Download on the Google Play About FAQ About Us Contact Terms Privacy Support Us Dark Mode Work With Us Advertise API Recommended K-Dramas Calendar Top 100 K-Dramas Top 100 Japanese Dramas Top 100 Chinese Dramas Top Anime",
            "Character Development",
            "Detective Supporting Character",
            "Fantasy",
            "Hye Jin and Yun Hwa. Their struggle with this new reality that they face",
            "I can see the reason(s). Well",
            "Jo Woong Genres: Comedy",
            "Melodrama Tags: Rags To Riches",
            "Romance",
            "Spirit",
            "Supernatural (Vote tags) Country: South Korea Type: Drama Episodes: 18 Aired: Apr  2",
            "The Miracle We Met",
            "Transmigration",
            "Tuesday Original Network: KBS2 Duration: 60 min. Content Rating: 15+ - Teens 15 or older Statistics Score: 8.0 (scored by 2",
            "Tuesday Original Network: KBS2 Duration: 60 min. Score: 8.0 (scored by 2",
            "Uriga Mannan Gijeok",
            "Wooriga Mannan Kijeok Screenwriter: Baek Mi Kyung Director: Lee Hyung Min",
            "and I was curious as to why. And after watching it",
            "as a viewer",
            "but I wish people would watch it",
            "but Kai is wonderfully and deliciously beautiful. - The drama focused on human behavior. And the mesaage it send is a good one. The things that I wasn't sure about: - This was more of a slow paced drama. Which isn't necessarily a bad thing. But around the middle part",
            "complicated. I",
            "especially Kim Myung Min (he will for me be one of the best male performance in drama this year with Lee Sun Kyun and Ji Jin Hee). Not to forget the OST  that mixed really well with all the scenes! I don't give it a 10 because this drama had a little problem",
            "fantasy and funny-tragedy (I don't know if this exist) you will really like it. Read More Was this review helpful to you? Yes No Cancel View all Recommendations Add Recommendations Recent Discussions New Topic Be the first to create a discussion for Miracle That We Met Remove ads Remove ads Details Title: Miracle That We Met Type: Drama Format: Standard Series Country: South Korea Episodes: 18 Aired: Apr  2",
            "go ahead and give it a try. Happy Watching!! Read More Was this review helpful to you? Yes No Cancel Completed Romane 14 people found this review helpful Other reviews by this user 0 May 30",
            "he was quite important in the beginning because we saw him quite often but after we didn't saw him at all",
            "it did seem a bit draggy. - A lot of moral dilemmas involved in the drama which I wasn't sure how to feel about. While the drama wasn't solely focused on romantic relationships",
            "it's a drama that deserves a chance. And it's quite enjoyable. So",
            "like some people said in the comments",
            "not many did thought it was really really good! If you like family",
            "not one of my ultimate favorite but still it was really well done. From the not predictable story which is really rare to do with k-dramas because you generally always know how it's going to end; to the superb acting done by everyone",
            "romance",
            "so I was like why did they introduce this guy to us if at the end they don't even matter?? (people who watched it will know about who I'm talking). I don't think everyone can like that kind of drama because a lot of people prefer to watch basic rom-com with young actors most of the time (and ofc I like it too)",
            "that they never expected is portrayed wonderfully. - The music is good. Specially the song 'Monochrome'. It fit the settings perfectly. - The kid actors did a good job too. - Not to sound like a fangirl or anything",
            "there could be a right and wrong in such exaggerated fantasical situation. Overall",
            "there was a little disappointment with one of the character story turn",
            "they were quite...well",
            "to an extent anyway. The things that I liked about the drama: -The storyline is unique. Not the one-person's-soul-entering-another-body thing. But the part that came after that. - The acting is top notch. You can feel every emotion of Song Huun Chul",
            "to the extent that they were present",
            "wasn't sure if what the male lead was doing could be considered \"right\". If"
        ],
        "showImage": null,
        "watchStartedOn": "03-03-2023",
        "watchEndedOn": "04-03-2023",
        "releasedYear": 2018,
        "releaseDate": "Apr  2, 2018",
        "totalEpisodes": 18,
        "showType": "Drama",
        "nativeLanguage": "Korean",
        "watchedLanguage": "Korean",
        "country": "South Korea",
        "comments": "Excellent. No Words To Explain. Though Out The Series, I Never Felt Anything Boring. However The Final Part Is Unexpected, If They Didn't Reverse The Time , It Would Be Much Better.",
        "ratings": 10,
        "genres": [
            "Family",
            "Fantasy",
            "Melodrama"
        ],
        "network": [
            "KBS2"
        ],
        "againWatchedDates": [
            "14-03-2023",
            "06-07-2023",
            "09-11-2023",
            "12-09-2023",
            "02-08-2025",
            "21-08-2025"
        ],
        "updatedOn": "01 November 2025",
        "updatedDetails": "Again Watched Dates Updated",
        "synopsis": "Miracle That We Met (Korean Drama); 우리가 만난 기적; The Miracle We Met;Uriga Mannan Gijeok;Wooriga Mannan Kijeok; An ordinary man dies in a car crash, (Source: MyDramaList)",
        "topRatings": 7000,
        "Duration": 60,
        "sitePriorityUsed": {
            "showImage": null,
            "releaseDate": "mydramalist",
            "otherNames": "mydramalist",
            "duration": null,
            "synopsis": "mydramalist",
            "Duration": "mydramalist"
        }
    },
    {
        "showID": 102,
        "showName": "Meloholic",
        "otherNames": [],
        "showImage": null,
        "watchStartedOn": "01-03-2023",
        "watchEndedOn": "02-03-2023",
        "releasedYear": 2017,
        "releaseDate": "Nov  6, 2017",
        "totalEpisodes": 12,
        "showType": "Drama",
        "nativeLanguage": "Korean",
        "watchedLanguage": "Korean",
        "country": "South Korea",
        "comments": "Nice Drama. The Sad Part Is The Series Has Only 10 Episode. Nice Melodrama.EEEE",
        "ratings": 9,
        "genres": [
            "Melodrama",
            "Romance"
        ],
        "network": [
            "OCN"
        ],
        "againWatchedDates": [
            "12-07-2025",
            "06-07-2023"
        ],
        "updatedOn": "01 November 2025",
        "updatedDetails": "Total Episodes, Comments, Again Watched Dates Updated",
        "synopsis": "Yoo Eun Ho has a special ability which allows him to read the minds of other people when he places his hand on them. Due to his special ability, he can't... (Source: MyDramaList)",
        "topRatings": 2700,
        "Duration": 60,
        "sitePriorityUsed": {
            "showImage": null,
            "releaseDate": "mydramalist",
            "otherNames": null,
            "duration": null,
            "synopsis": "mydramalist",
            "Duration": "mydramalist"
        }
    },
    {
        "showID": 103,
        "showName": "Crash Landing On You",
        "otherNames": [
            "000 years. It was so refreshing to see Son Ye Jin step out of her usual Melodrama set-ups (well",
            "2019 - Feb 16",
            "2019 - Feb 16",
            "2020 16 of 16 episodes seen Completed 11 Overall 10 Story 10 Acting/Cast 10 Music 10 Rewatch Value 10 SOS: I'm in love with Hyun Bin (again) T-T This drama was just addictive! The plot had the right dose of rom-com",
            "2020 16 of 16 episodes seen Completed 4 Overall 10 Story 10 Acting/Cast 10 Music 10 Rewatch Value 10 Crash Landing on My Heart. “If you give up on waiting",
            "2020 Aired On: Sunday",
            "2020 Aired On: Sunday",
            "2020 How do you think this drama will end? by qt_dramas 78 0 DJRuth79 Feb 17",
            "2020 View all Remove ads Remove ads Details Title: Crash Landing on You Type: Drama Format: Standard Series Country: South Korea Episodes: 16 Aired: Dec 14",
            "2022 I made a piano cover of Flower by Yoon mirae because I loved this series so much! by Matthew Olls 4 0 Matthew Olls Jun 11",
            "2024 Is this a Ji Chang Wook cameo in episode 5? by KuroSenpai 6 0 KuroSenpai Aug  6",
            "269 users ) Ranked: #70 Popularity: #5 Content Rating: 15+ - Teens 15 or older Watchers: 249",
            "269 users) Ranked: #70 Popularity: #5 Watchers: 249",
            "904 Favorites: 0 Remove ads Where to Watch Crash Landing on You Netflix Subscription (sub) TVING Subscription Cast & Credits Add Cast Hyun Bin Ri Jeong Hyeok Main Role Son Ye Jin Yun Se Ri Main Role Seo Ji Hye Seo Dan Main Role Kim Jung Hyun Koo Seung Jun Main Role Yang Kyung Won Pyo Chi Su [5th Company master sergeant] Support Role Lee Shin Young Park Gwang Beom [5th Company first lieutenant] Support Role View all (151) Photos View all (716) Reviews Write Review Completed Yupon68 381 people found this review helpful Other reviews by this user 4 Feb 16",
            "904 Favorites: 0 Top Contributors Tarnished 520 edits hoshiakari 209 edits MrBouBou 120 edits adrien 91 edits News & Articles Kim Sun Young confirmed to star alongside Park Bo Young and GOT7's Park Jin Young in 'Our Unwritten Im Chul Soo joins Park Bo Young and GOT7's Park Jin Young in 'Our Unwritten Seoul' Popular Lists Related lists from users Create a list All Time Favorite Dramas 807 titles 2010 loves 38 Arranged/Fake/Forced Marriage 99 titles 271 loves 9 tvN Dramas 353 titles 234 loves Recently Watched By Remove ads © Copyright 2025. All rights reserved. Download on the App Store Download on the Google Play About FAQ About Us Contact Terms Privacy Support Us Dark Mode Work With Us Advertise API Recommended K-Dramas Calendar Top 100 K-Dramas Top 100 Japanese Dramas Top 100 Chinese Dramas Top Anime",
            "A Szerelem Siklóernyőn Érkezik",
            "Army",
            "Army Captain Male Lead",
            "Aterizare Forțată în Brațele Tale",
            "Aterrizaje de emergencia en tu corazón",
            "Breakdown of Love",
            "Calm Male Lead (Vote tags) Country: South Korea Type: Drama Episodes: 16 Aired: Dec 14",
            "Comedy",
            "Crash Landing of Love",
            "Emergency Lands of Love",
            "Emergency Love Landing",
            "Fate",
            "I would say: HYUN BIN'S POUT!!!!!!!!!!! Read More Was this review helpful to you? Yes No Cancel View all Recommendations Add Recommendations Recent Discussions New Topic Title Replies Views Latest Post hey can we talk about ri jeong hyeok's thoughtful acts? by sgnileefevahi 0 0 No discussions yet Why are there so many subplots? Ep 3 spoilers by herefortv 0 0 No discussions yet Ahhh!!! They are getting married in Real Life!! by Rose 2 0 Niko_cat123 Jan 19",
            "Intercountry Romance",
            "Lee Jeong-hyo",
            "Love Crashes",
            "Love's Crash Landing",
            "Love’s Emergency Landing",
            "Láska padá z nebe",
            "Nice Male Lead",
            "Noodlanding op jou",
            "Park Ji-eun",
            "Political Tags: North And South Korea",
            "Pousando no Amor",
            "Rich Female Lead",
            "Romance",
            "Sarangui Boolshichak",
            "Sarangui Bulsichag",
            "Sarangui Bulsichak",
            "Saturday Original Network: tvN Duration: 1 hr. 25 min. Content Rating: 15+ - Teens 15 or older Statistics Score: 9.0 (scored by 147",
            "Saturday Original Network: tvN Duration: 1 hr. 25 min. Score: 9.0 (scored by 147",
            "Soldier Male Lead",
            "Soldier Supporting Character",
            "The Crash of Love",
            "Unsettling Lo",
            "a love story whose premise was there from the beginning and revealed brilliantly in the steady epilogues. But also the comedy of the sidekicks—and the horror of the bad guy consumed with envy and jealousy that destroys innocence and beauty",
            "a pianist who becomes a  NK army officer",
            "a quiet philosopher and tomato plant caretaker with a “low voice”—the kindest man I believe I’ve ever seen in any narrative—who adores the hurt woman",
            "all the way to the  belief in a Zen appreciation for patience and waiting; also kindness",
            "and Capt. Ri’s delightful squad",
            "and closure while keeping her audience intrigued and in love with her characters. The director",
            "and heartbreak",
            "and loves her no matter what evil",
            "and the cast brings everything to life",
            "and unconditional love. The themes drive the plot",
            "beautiful OST",
            "beautiful but hurt SK woman who learns to love herself as well as others",
            "being abandoned and becoming a street orphan",
            "blow breeze). Also the fact that the woman was the one who had the played the field and had experiences with relationships",
            "comedy",
            "danger",
            "dominating male)(king2heart",
            "dubbed “the ducklings”—all of whom became a family for one another and for the viewers. 3. Themes varying from the pain of losing family",
            "engendering the North as the poor",
            "especially for its fascinating strong woman lead and the equally strong",
            "finds her",
            "funny heiress. She nailed this role. I loved what she was wearing in North Korea (anyone remember the sunflower-print dress? It was so lovely). I also loved the fact that she did not wear any make-up in her North Korea scenes. In fact",
            "gentle man who loves and protects her. But also for some of the following points: 1. The writer",
            "haha) and play a badass",
            "he sounds too good to be true. . . . .but he’s not. The whole world is in love with Capt. Ri because Hyun Bin developed him and made us believe that such a man can exist. 8. Talented Hyun Bin and Son Ye Jin",
            "heartwarming gestures",
            "hilarious village ajummas",
            "kept everything focused and carefully paced so that the series steadily evolved each week. 2. The cast is one of the best I’ve seen with immensely beautiful and talented leads",
            "knowing how to balance drama",
            "knows who she is",
            "laughter",
            "lol. \"RESPECT\" xD). The OST was perfect! I already want to watch it again. The chemistry was so",
            "love the fact that the girl  was from South and the guy from North (usually it is the other way around",
            "making this the classical struggle between good and evil embraced by every generation since time. 5. The  touching",
            "making us impatient for each weekend to finally roll around so we can see what happens next to our beloved characters—whether love",
            "melo damsel-in-distress",
            "most of the time anyway",
            "one of the biggest charms of this drama lie in the fact that the writer tried to subvert the usual norms. Son Ye Jin played a heiress (not the typical",
            "poor",
            "possibly dying) and Hyun Bin played a sweet guy (unlike his usual jerk characters). Also",
            "protection",
            "protects her",
            "sacrifice",
            "so good. If I had to summarize this drama in one scene/phrase",
            "so perfect). I could go on for70",
            "the pain of loss will kill you. That’s why I wait.” —Captain Ri. Most people who have watched the entire series love CLOY",
            "themes",
            "warm",
            "we got on that train with them. 4. A great story that keeps the reader interested",
            "weak female and the South as the strong",
            "what danger threatens them. Yes",
            "which is one of KDrama’s finest",
            "which many fans have downloaded. The piano piece  “Song for My Brother” leaves me in tears every time. 6. A wealthy",
            "while the guy was innocent and sweet. All this breathed life and freshness into the drama. The second leads were great. So happy to see Seo Ji Hye landing a lead role. She is so deserving. Seo Dan was not a nasty second lead. She was so nice beneath all that hard exterior. Hyun Bin's subordinates were so awesome. My favorite was the one who loved Choi Ji Woo and Korean dramas but I loved all of them really. The maknae was so adorable! The cameos were great. The rest of the supporting cast was awesome. I loved North Korean ahjummas. They remind me of Reply 1988. Seo Dan's mother and uncle were awesome (I realized so belated they worked in Parasite",
            "who also gave us “You Who Came from the Stars",
            "who can be hilarious and sassy",
            "who has worked on many series and movies",
            "who wanted to work together again after “The Negotiation” and gave us “the gift” of “Crash Landing on You.”  Thank you from our hearts. And congratulations on the many awards the CLOY team have won and for the love you found in one another.  You blessed those of us who love you and this series. —A J McAninch Read More Was this review helpful to you? Yes No Cancel Completed palak 229 people found this review helpful Other reviews by this user 11 Feb 16",
            "witty dialogues and action. Every episode ended on such a cliffhanger that kept you restless for the rest of the week until Saturday came to take the edge off ;) Hyun Bin was just adorable and sexy and honest and honorable and kind and perfect (so",
            "yet who finds strength in loving and protecting the most amazing man—Capt. Ri. 7. A beautiful man",
            "Аварийная посадка любви",
            "Аварійна посадка – кохання",
            "كراش من السماء",
            "ปักหมุดรักฉุกเฉิน",
            "” is one of the best",
            "爱的迫降 Screenwriter: Park Ji Eun Director: Lee Jeong Hyo Genres: Military"
        ],
        "showImage": null,
        "watchStartedOn": "09-03-2023",
        "watchEndedOn": "10-03-2023",
        "releasedYear": 2019,
        "releaseDate": "Dec 14, 2019",
        "totalEpisodes": 16,
        "showType": "Drama",
        "nativeLanguage": "Korean",
        "watchedLanguage": "Korean",
        "country": "South Korea",
        "comments": "Nice Drama. Heartwarming. Ending Is Nice",
        "ratings": 10,
        "genres": [
            "Action",
            "Army",
            "Melodrama",
            "Rich Girl",
            "Romance"
        ],
        "network": [
            "tvN"
        ],
        "againWatchedDates": [
            "21-09-2023",
            "29-09-2023",
            "11-12-2023",
            "12-07-2023",
            "24-02-2024",
            "15-05-2024",
            "26-07-2025"
        ],
        "updatedOn": "01 November 2025",
        "updatedDetails": "First Time Uploaded",
        "synopsis": "Crash Landing on You (Korean Drama); 사랑의 불시착; A Szerelem Siklóernyőn Érkezik;Aterizare Forțată în Brațele Tale;Aterrizaje de emergencia en tu (Source: MyDramaList)",
        "topRatings": 8000,
        "Duration": 25,
        "sitePriorityUsed": {
            "showImage": null,
            "releaseDate": "mydramalist",
            "otherNames": "mydramalist",
            "duration": null,
            "synopsis": "mydramalist",
            "Duration": "mydramalist"
        }
    }
]