[
    {
        "showID": 101,
        "showName": "I Miss You",
        "otherNames": [
            "198 Favorites: 0 Remove ads Cast & Credits Add Cast Tan Jian Ci Bai Xiao Yu Main Role Zhang Jing Yi Wang Jin Jin Main Role Jiang Long Lao Cai Support Role Liu Lian Zheng Mo Li Support Role Xia Li Xin Wang Mei Lian Support Role Hou Chang Rong [Xiao Yu's father] Support Role View all (8) Photos View all (75) Reviews Write Review Completed cryswash 14 people found this review helpful Other reviews by this user 1 May  5",
            "198 Favorites: 0 Top Contributors enigmatic 22 edits yangela 8 edits Leo 7 edits LouM 7 edits News & Articles A New Wave of Talent: Discovering the Rising Stars of China Popular Lists Related lists from users Create a list Which C-Drama Are We Watching Next? 632 titles 188 loves 25 future releases 417 titles 14 loves Drama about Sick (disease/illness/disability) 406 titles 28 loves 2 Recently Watched By Remove ads © Copyright 2025. All rights reserved. Download on the App Store Download on the Google Play About FAQ About Us Contact Terms Privacy Support Us Dark Mode Work With Us Advertise API Recommended K-Dramas Calendar Top 100 K-Dramas Top 100 Japanese Dramas Top 100 Chinese Dramas Top Anime",
            "2024 Completed 1 Overall 7.0 Story 6.0 Acting/Cast 9.0 Music 7.0 Rewatch Value 6.0 Had Potential to be Greater This movie was a decent watch but seemed to only scratch the surface of what could have been a really great love story. The casting choice was good. The acting was strong and kept me engaged and the plot setup was interesting but I found trouble connecting with the story. I felt as if the details of this story was missing. There were a lot of time jumps",
            "2024 Completed 3 Overall 9.5 Story 9.5 Acting/Cast 10 Music 9.0 Rewatch Value 10 A Very Great Movie I waited for this and Thank god it delivered. The moment I saw this uploaded on *cough* sketchy sites *cough*. I immediately stopped everything that I was doing and sat down to watch it. The story is predictable and formulaic",
            "2024 Duration: 1 hr. 52 min. Content Rating: Not Yet Rated Statistics Score: 7.8 (scored by 651 users) Ranked: #3440 Popularity: #6339 Watchers: 2",
            "2024 Duration: 1 hr. 52 min. Score: 7.8 (scored by 651 users ) Ranked: #3440 Popularity: #6339 Content Rating: Not Yet Rated Watchers: 2",
            "Again And Again",
            "Bei Wo Nong Diu De Ni",
            "Bei Wo Nong Diu Liang Ci De Wang Jin Jin",
            "Cohabitation (Vote tags) Country: China Type: Movie Release Date: Mar  8",
            "Drama Tags: Time Skip",
            "I felt the same. It's heavily focused on the main couple. They're readable",
            "I kept pausing every time just to commentate and analyze what just happened",
            "I might as well have made a reaction video at that point and posted it online. Overall",
            "I was like \"Ahh",
            "I was still wrong when it came to the story beats because how they did it is pretty unpredictable. I even cried at some scenes for how impactful it was. When it comes to the characters",
            "I wish they'd added some extra details to his illness to make it more relatable and scary. While watching this",
            "Love At First Sight",
            "a very great movie",
            "as if I had someone beside me",
            "basically my 2 aspirations. Also",
            "but I love their chemistry. Even though the movie doesn't tell",
            "but hold on! Let me explain. I don't really read the synopsis. None at all. I like going in blind whenever I watch something and just let the story do its job. Now",
            "despite the story structure being familiar to me. I highly recommend it. Read More Was this review helpful to you? Yes No Cancel View all Recommendations Add Recommendations Recent Discussions New Topic Be the first to create a discussion for I Miss You Remove ads Remove ads Details Title: I Miss You Type: Movie Format: Feature Film Country: China Release Date: Mar  8",
            "it is more about just showing you what it can do. And that's how you know that the actors did a great job of conveying the thoughts and emotions of the characters through their acting. I was so engrossed by the character writing that my attention is sucked in and the main couple are Writer and Artist",
            "like this and that\" just from how they are speed running the build-up on how they become a couple in the beginning. And I didn't mind that just because I've seen it being similarly done before a thousand times doesn't mean I'm not going to enjoy it. I still kept watching because I was curious how they gonna do it. Even though I already called it what the movie is going to be about",
            "oh my god!!! Zhang Jing Yi's hair😭😭😭 The stylist has to go to jail for that!!! Thank god it got fixed after the time skip. ML is handsome and cute",
            "reminiscing and bits of situations being presented but not much was being shown about their relationship except for some of the ugly moments. We didn’t see much of the build up or connection being built between the two so it left a lot to be desired. I did enjoy the literary references as it attempted to provide a deeper connection with their love story. Read More Was this review helpful to you? Yes No Cancel Completed Jae Jin 9 people found this review helpful Other reviews by this user 3 Apr 15",
            "so the movie is gonna about the struggles and the challenges that they have to face",
            "what I mean by \"predictable and formulaic\" is that the way the story is structured already follows a blueprint that I'm familiar with because when I watched it just 5-10 minutes in",
            "被我弄丟兩次的王斤斤",
            "被我弄丢两次的王斤斤 Screenwriter: Zheng Zhi Director: Han Yan Genres: Romance"
        ],
        "showImage": null,
        "watchStartedOn": "04-03-2023",
        "watchEndedOn": "06-03-2023",
        "releasedYear": 2014,
        "releaseDate": "Mar  8, 2024",
        "totalEpisodes": 21,
        "showType": "Drama",
        "nativeLanguage": "Korean",
        "watchedLanguage": "Korean",
        "country": "South Korea",
        "comments": "Initally It Was Interesting But After They Return From France To Korea Then Started Getting Boring, Not Satisfied With The Ending.",
        "ratings": 5,
        "genres": [
            "Drama",
            "Melodrama",
            "Romance"
        ],
        "network": [
            "MBC TV"
        ],
        "againWatchedDates": [],
        "updatedOn": "01 November 2025",
        "updatedDetails": "First Time Uploaded",
        "synopsis": "I Miss You (Chinese Movie); 被我弄丢的你; Again And Again;Bei Wo Nong Diu De Ni;Bei Wo Nong Diu Liang Ci De Wang Jin Jin;被我弄丟兩次的王斤斤;被我弄丢两次的王斤斤; (Source: MyDramaList)",
        "topRatings": 500,
        "Duration": 52,
        "sitePriorityUsed": {
            "showImage": null,
            "releaseDate": "mydramalist",
            "otherNames": "mydramalist",
            "duration": null,
            "synopsis": "mydramalist",
            "Duration": "mydramalist"
        }
    }
]