{
    "scriptVersion": "v3.3",
    "runID": "RUN_20251127_143706",
    "timestamp": "27 November 2025 02:37 PM (IST)",
    "showID": 102,
    "showName": "Abyss",
    "fetchedFields": {
        "image": {
            "value": "https://brucebanner001.github.io/my-movie-database/images/102.jpg",
            "source": "asianwiki"
        },
        "releaseDate": {
            "value": "May 6 - June 25, 2019",
            "source": "asianwiki"
        },
        "otherNames": {
            "value": [
                "Abyss: Soul Revival Marble",
                "Eobiseu",
                "Hlubina",
                "Magia din Abis",
                "O Abismo Mágico",
                "Бездна",
                "لقاء بعد الموت",
                "ลูกแก้วคืนวิญญาณ",
                "アビス",
                "深渊"
            ],
            "source": "mydramalist"
        },
        "synopsis": {
            "value": "\"Abyss\" is the tale of a man and a woman who tragically meet their demise but are granted a second chance at life through soul-reviving marbles found in a mystical abyss.\n\nGo Se Yeon, a resilient and exceptionally beautiful female prosecutor at the Seoul District Public Office, succumbs to a fatal accident. However, her revival comes with a twist as the enigmatic Abyss marble transforms her appearance to a more ordinary one,reflecting the goodness of her spirit from her previous life.\n\nOn the other hand, Cha Min, the brilliant heir to a leading Korean cosmetics company, is a smart, humble, and kind-hearted man who struggles with self-esteem due to his perceived unattractiveness. After his own fatal accident, Cha Min returns to life with a newfound handsome appearance that matches the brightness of his previous spirit.\n\nAs they both embark on their second lives, Go Se Yeon and Cha Min join forces as a lawyer and an administrator at a private law firm. Together, they delve into the mysteries of the magical Abyss and, amidst their investigations, find love blossoming in their shared journey of self-acceptance.\n\n(",
            "source": "mydramalist"
        },
        "duration": {
            "value": "60 mins",
            "source": "mydramalist"
        },
        "director": {
            "value": [
                "Yoo Je Won"
            ],
            "source": "mydramalist",
            "source_link": "https://mydramalist.com/30554-abyss"
        },
        "tags": {
            "value": [
                "Murder",
                "Reincarnation",
                "Nice Male Lead",
                "Death",
                "Hidden Identity",
                "Investigation",
                "Supernatural",
                "Age Gap [Real Life]",
                "Hardworking Female Lead",
                "Smart Female Lead",
                "(Vote tags)"
            ],
            "source": "mydramalist",
            "source_link": "https://mydramalist.com/30554-abyss"
        }
    }
}